# Напишите функцию process_strings(s1, s2), которая принимает две строки s1 и s2 и выполняет следующие операции:
# Создайте множество set1, содержащее уникальные символы из строки s1, и множество set2, содержащее уникальные символы из строки s2.

def process_strings (s1: str, s2: str) -> None:
    set1 = set(s1)
    set2 = set(s2)

    print (''.join(set1.union(set2)))
    print(''.join(set1.intersection(set2)))
    print(''.join(set1.symmetric_difference(set2)))

def main ():
    process_strings("hello", "world")

main()
# Найдите и верните:
# Объединение множеств set1 и set2.
# Пересечение множеств set1 и set2.
# Симметрическую разность множеств set1 и set2.
# Переведите полученные множества (объединение, пересечение, симметрическую разность) обратно в строки, отсортируйте символы в алфавитном порядке и верните результаты в виде словаря, где ключами будут названия операций, а значениями — соответствующие строки.
# Пример использования функции:
#
# result = process_strings("hello", "world")
# print(result)
# Ожидаемый вывод:
#
# {
#     'union': 'dhlorw',
#     'intersection': 'lo',
#     'symmetric_difference': 'hewr'
# }
# Подсказки:
#
# Используйте функции set(), чтобы создавать множества.
# Для объединения можно использовать оператор |, для пересечения — &, для симметрической разности — ^.
# Для преобразования обратно в строку используйте метод join().
